Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="32xxxx" edc:clonedfrom="PIC32MK0512MCJ064" edc:desc="" edc:dosid="02481" edc:dsid="60001570" edc:informedby="DOS PS DS" edc:isextended="false" edc:masksetid="WACN" edc:name="PIC32MK0256MCJ064" edc:procid="0x05F0" edc:psid="60001145V" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Import/>
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.300" edc:maxvoltage="3.600" edc:minvoltage="2.200"/>
    <edc:VDD edc:maxdefaultvoltage="3.600" edc:maxvoltage="3.600" edc:mindefaultvoltage="2.200" edc:minvoltage="2.200" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haschecksum="false" edc:haslvp2="true">
    <edc:ProgrammingWaitTime edc:progop="erase" edc:time="2000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="pgm" edc:time="10000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="cfg" edc:time="10000" edc:timeunits="us"/>
    <edc:ProgrammingRowSize edc:nzsize="128" edc:progop="pgm"/>
    <edc:ProgrammingRowSize edc:nzsize="128" edc:progop="cfg"/>
    <edc:Wait edc:erase="2000" edc:pgm="10000" edc:cfg="10000"/>
    <edc:Latches edc:pgm="128" edc:cfg="128"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="32xxxx" edc:name="32xxxx">
    <edc:MemTraits edc:addrinc="0x4" edc:locsize="0x4" edc:wordimpl="0xffffffff" edc:wordinit="0xffffffff" edc:wordsafe="0xffffffff" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet>
    <edc:InstructionSet edc:instructionsetid="mips32r2"/>
    <edc:InstructionSet edc:instructionsetid="micromips"/>
    <edc:InstructionSet edc:instructionsetid="dspr2"/>
  </edc:InstructionSet>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList edc:hasvariableoffsets="true" edc:interruptcontrollerflavor="int_evic_v3" edc:shadowsetcount="8">
    <edc:Interrupt edc:cname="CORE_TIMER" edc:desc="Core Timer Interrupt" edc:irq="0"/>
    <edc:Interrupt edc:cname="CORE_SOFTWARE_0" edc:desc="Core Software Interrupt 0" edc:irq="1"/>
    <edc:Interrupt edc:cname="CORE_SOFTWARE_1" edc:desc="Core Software Interrupt 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="EXTERNAL_0" edc:desc="External Interrupt 0" edc:irq="3"/>
    <edc:Interrupt edc:cname="TIMER_1" edc:desc="Timer1" edc:irq="4"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_1_ERROR" edc:desc="Input Capture 1 Error" edc:irq="5"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_1" edc:desc="Input Capture 1" edc:irq="6"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_1" edc:desc="Output Compare 1" edc:irq="7"/>
    <edc:Interrupt edc:cname="EXTERNAL_1" edc:desc="External Interrupt 1" edc:irq="8"/>
    <edc:Interrupt edc:cname="TIMER_2" edc:desc="Timer2" edc:irq="9"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_2_ERROR" edc:desc="Input Capture 2 Error" edc:irq="10"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_2" edc:desc="Input Capture 2" edc:irq="11"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_2" edc:desc="Output Compare 2" edc:irq="12"/>
    <edc:Interrupt edc:cname="EXTERNAL_2" edc:desc="External Interrupt 2" edc:irq="13"/>
    <edc:Interrupt edc:cname="TIMER_3" edc:desc="Timer3" edc:irq="14"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_3_ERROR" edc:desc="Input Capture 3 Error" edc:irq="15"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_3" edc:desc="Input Capture 3" edc:irq="16"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_3" edc:desc="Output Compare 3" edc:irq="17"/>
    <edc:Interrupt edc:cname="EXTERNAL_3" edc:desc="External Interrupt 3" edc:irq="18"/>
    <edc:Interrupt edc:cname="TIMER_4" edc:desc="Timer4" edc:irq="19"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_4_ERROR" edc:desc="Input Capture 4 Error" edc:irq="20"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_4" edc:desc="Input Capture 4" edc:irq="21"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_4" edc:desc="Output Compare 4" edc:irq="22"/>
    <edc:Interrupt edc:cname="EXTERNAL_4" edc:desc="External Interrupt 4" edc:irq="23"/>
    <edc:Interrupt edc:cname="TIMER_5" edc:desc="Timer5" edc:irq="24"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_5_ERROR" edc:desc="Input Capture 5 Error" edc:irq="25"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_5" edc:desc="Input Capture 5" edc:irq="26"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_5" edc:desc="Output Compare 5" edc:irq="27"/>
    <edc:Interrupt edc:cname="RTCC" edc:desc="Real Time Clock" edc:irq="30"/>
    <edc:Interrupt edc:cname="FLASH_CONTROL" edc:desc="Flash Control Event" edc:irq="31"/>
    <edc:Interrupt edc:cname="COMPARATOR_1" edc:desc="Comparator 1 Interrupt" edc:irq="32"/>
    <edc:Interrupt edc:cname="COMPARATOR_2" edc:desc="Comparator 2 Interrupt" edc:irq="33"/>
    <edc:Interrupt edc:cname="SPI1_FAULT" edc:desc="SPI1 Fault" edc:irq="35"/>
    <edc:Interrupt edc:cname="SPI1_RX" edc:desc="SPI1 Receive Done" edc:irq="36"/>
    <edc:Interrupt edc:cname="SPI1_TX" edc:desc="SPI1 Transfer Done" edc:irq="37"/>
    <edc:Interrupt edc:cname="UART1_FAULT" edc:desc="UART1 Fault" edc:irq="38"/>
    <edc:Interrupt edc:cname="UART1_RX" edc:desc="UART1 Receive Done" edc:irq="39"/>
    <edc:Interrupt edc:cname="UART1_TX" edc:desc="UART1 Transfer Done" edc:irq="40"/>
    <edc:Interrupt edc:cname="I2C1_BUS" edc:desc="I2C1 Bus Collision Event" edc:irq="41"/>
    <edc:Interrupt edc:cname="I2C1_SLAVE" edc:desc="I2C1 Slave Event" edc:irq="42"/>
    <edc:Interrupt edc:cname="I2C1_MASTER" edc:desc="I2C1 Master Event" edc:irq="43"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_A" edc:desc="PORTA Input Change Interrupt" edc:irq="44"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_B" edc:desc="PORTB Input Change Interrupt" edc:irq="45"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_C" edc:desc="PORTC Input Change Interrupt" edc:irq="46"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_D" edc:desc="PORTD Input Change Interrupt" edc:irq="47"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_E" edc:desc="PORTE Input Change Interrupt" edc:irq="48"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_F" edc:desc="PORTF Input Change Interrupt" edc:irq="49"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_G" edc:desc="PORTG Input Change Interrupt" edc:irq="50"/>
    <edc:Interrupt edc:cname="SPI2_FAULT" edc:desc="SPI2 Fault" edc:irq="53"/>
    <edc:Interrupt edc:cname="SPI2_RX" edc:desc="SPI2 Receive Done" edc:irq="54"/>
    <edc:Interrupt edc:cname="SPI2_TX" edc:desc="SPI2 Transfer Done" edc:irq="55"/>
    <edc:Interrupt edc:cname="UART2_FAULT" edc:desc="UART2 Fault" edc:irq="56"/>
    <edc:Interrupt edc:cname="UART2_RX" edc:desc="UART2 Receive Done" edc:irq="57"/>
    <edc:Interrupt edc:cname="UART2_TX" edc:desc="UART2 Transfer Done" edc:irq="58"/>
    <edc:Interrupt edc:cname="I2C2_BUS" edc:desc="I2C2 Bus Collision Event" edc:irq="59"/>
    <edc:Interrupt edc:cname="I2C2_SLAVE" edc:desc="I2C2 Slave Event" edc:irq="60"/>
    <edc:Interrupt edc:cname="I2C2_MASTER" edc:desc="I2C2 Master Event" edc:irq="61"/>
    <edc:Interrupt edc:cname="CTMU" edc:desc="CTMU Interrupt" edc:irq="71"/>
    <edc:Interrupt edc:cname="DMA0" edc:desc="DMA Channel 0" edc:irq="72"/>
    <edc:Interrupt edc:cname="DMA1" edc:desc="DMA Channel 1" edc:irq="73"/>
    <edc:Interrupt edc:cname="DMA2" edc:desc="DMA Channel 2" edc:irq="74"/>
    <edc:Interrupt edc:cname="DMA3" edc:desc="DMA Channel 3" edc:irq="75"/>
    <edc:Interrupt edc:cname="TIMER_6" edc:desc="Timer6" edc:irq="76"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_6_ERROR" edc:desc="Input Capture 6 Error" edc:irq="77"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_6" edc:desc="Input Capture 6" edc:irq="78"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_6" edc:desc="Output Compare 6" edc:irq="79"/>
    <edc:Interrupt edc:cname="TIMER_7" edc:desc="Timer7" edc:irq="80"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_7_ERROR" edc:desc="Input Capture 7 Error" edc:irq="81"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_7" edc:desc="Input Capture 7" edc:irq="82"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_7" edc:desc="Output Compare 7" edc:irq="83"/>
    <edc:Interrupt edc:cname="TIMER_8" edc:desc="Timer8" edc:irq="84"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_8_ERROR" edc:desc="Input Capture 8 Error" edc:irq="85"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_8" edc:desc="Input Capture 8" edc:irq="86"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_8" edc:desc="Output Compare 8" edc:irq="87"/>
    <edc:Interrupt edc:cname="TIMER_9" edc:desc="Timer9" edc:irq="88"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_9_ERROR" edc:desc="Input Capture 9 Error" edc:irq="89"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_9" edc:desc="Input Capture 9" edc:irq="90"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_9" edc:desc="Output Compare 9" edc:irq="91"/>
    <edc:Interrupt edc:cname="ADC" edc:desc="ADC Global Interrupt" edc:irq="92"/>
    <edc:Interrupt edc:cname="ADC_DC1" edc:desc="ADC Digital Comparator 1" edc:irq="94"/>
    <edc:Interrupt edc:cname="ADC_DC2" edc:desc="ADC Digital Comparator 2" edc:irq="95"/>
    <edc:Interrupt edc:cname="ADC_DF1" edc:desc="ADC Digital Filter 1" edc:irq="96"/>
    <edc:Interrupt edc:cname="ADC_DF2" edc:desc="ADC Digital Filter 2" edc:irq="97"/>
    <edc:Interrupt edc:cname="ADC_DF3" edc:desc="ADC Digital Filter 3" edc:irq="98"/>
    <edc:Interrupt edc:cname="ADC_DF4" edc:desc="ADC Digital Filter 4" edc:irq="99"/>
    <edc:Interrupt edc:cname="ADC_FAULT" edc:desc="ADC Fault" edc:irq="100"/>
    <edc:Interrupt edc:cname="ADC_EOS" edc:desc="ADC End of Scan" edc:irq="101"/>
    <edc:Interrupt edc:cname="ADC_ARDY" edc:desc="ADC Ready" edc:irq="102"/>
    <edc:Interrupt edc:cname="ADC_URDY" edc:desc="ADC Update Ready After Suspend" edc:irq="103"/>
    <edc:Interrupt edc:cname="ADC_DMA" edc:desc="ADC First Class Channels DMA" edc:irq="104"/>
    <edc:Interrupt edc:cname="ADC_EARLY" edc:desc="ADC Early Group Interrupt" edc:irq="105"/>
    <edc:Interrupt edc:cname="ADC_DATA0" edc:desc="ADC Data 0" edc:irq="106"/>
    <edc:Interrupt edc:cname="ADC_DATA1" edc:desc="ADC Data 1" edc:irq="107"/>
    <edc:Interrupt edc:cname="ADC_DATA2" edc:desc="ADC Data 2" edc:irq="108"/>
    <edc:Interrupt edc:cname="ADC_DATA3" edc:desc="ADC Data 3" edc:irq="109"/>
    <edc:Interrupt edc:cname="ADC_DATA4" edc:desc="ADC Data 4" edc:irq="110"/>
    <edc:Interrupt edc:cname="ADC_DATA5" edc:desc="ADC Data 5" edc:irq="111"/>
    <edc:Interrupt edc:cname="ADC_DATA6" edc:desc="ADC Data 6" edc:irq="112"/>
    <edc:Interrupt edc:cname="ADC_DATA7" edc:desc="ADC Data 7" edc:irq="113"/>
    <edc:Interrupt edc:cname="ADC_DATA8" edc:desc="ADC Data 8" edc:irq="114"/>
    <edc:Interrupt edc:cname="ADC_DATA9" edc:desc="ADC Data 9" edc:irq="115"/>
    <edc:Interrupt edc:cname="ADC_DATA10" edc:desc="ADC Data 10" edc:irq="116"/>
    <edc:Interrupt edc:cname="ADC_DATA11" edc:desc="ADC Data 11" edc:irq="117"/>
    <edc:Interrupt edc:cname="ADC_DATA12" edc:desc="ADC Data 12" edc:irq="118"/>
    <edc:Interrupt edc:cname="ADC_DATA13" edc:desc="ADC Data 13" edc:irq="119"/>
    <edc:Interrupt edc:cname="ADC_DATA14" edc:desc="ADC Data 14" edc:irq="120"/>
    <edc:Interrupt edc:cname="ADC_DATA15" edc:desc="ADC Data 15" edc:irq="121"/>
    <edc:Interrupt edc:cname="ADC_DATA16" edc:desc="ADC Data 16" edc:irq="122"/>
    <edc:Interrupt edc:cname="ADC_DATA17" edc:desc="ADC Data 17" edc:irq="123"/>
    <edc:Interrupt edc:cname="ADC_DATA18" edc:desc="ADC Data 18" edc:irq="124"/>
    <edc:Interrupt edc:cname="ADC_DATA19" edc:desc="ADC Data 19" edc:irq="125"/>
    <edc:Interrupt edc:cname="ADC_DATA24" edc:desc="ADC Data 24" edc:irq="130"/>
    <edc:Interrupt edc:cname="ADC_DATA25" edc:desc="ADC Data 25" edc:irq="131"/>
    <edc:Interrupt edc:cname="ADC_DATA26" edc:desc="ADC Data 26" edc:irq="132"/>
    <edc:Interrupt edc:cname="ADC_DATA27" edc:desc="ADC Data 27" edc:irq="133"/>
    <edc:Interrupt edc:cname="ADC_DATA40" edc:desc="ADC Data 40" edc:irq="146"/>
    <edc:Interrupt edc:cname="ADC_DATA41" edc:desc="ADC Data 41" edc:irq="147"/>
    <edc:Interrupt edc:cname="ADC_DATA46" edc:desc="ADC Data 46" edc:irq="152"/>
    <edc:Interrupt edc:cname="ADC_DATA47" edc:desc="ADC Data 47" edc:irq="153"/>
    <edc:Interrupt edc:cname="ADC_DATA48" edc:desc="ADC Data 48" edc:irq="154"/>
    <edc:Interrupt edc:cname="ADC_DATA49" edc:desc="ADC Data 49" edc:irq="155"/>
    <edc:Interrupt edc:cname="ADC_DATA50" edc:desc="ADC Data 50" edc:irq="156"/>
    <edc:Interrupt edc:cname="ADC_DATA51" edc:desc="ADC Data 51" edc:irq="157"/>
    <edc:Interrupt edc:cname="ADC_DATA52" edc:desc="ADC Data 52" edc:irq="158"/>
    <edc:Interrupt edc:cname="ADC_DATA53" edc:desc="ADC Data 53" edc:irq="159"/>
    <edc:Interrupt edc:cname="COMPARATOR_3" edc:desc="Comparator 3 Interrupt" edc:irq="160"/>
    <edc:Interrupt edc:cname="COMPARATOR_4" edc:desc="Comparator 4 Interrupt" edc:irq="161"/>
    <edc:Interrupt edc:cname="COMPARATOR_5" edc:desc="Comparator 5 Interrupt" edc:irq="162"/>
    <edc:Interrupt edc:cname="CAN1" edc:desc="CAN1 Global Interrupt" edc:irq="167"/>
    <edc:Interrupt edc:cname="QEI1" edc:desc="QEI 1 Interrupt" edc:irq="169"/>
    <edc:Interrupt edc:cname="QEI2" edc:desc="QEI 2 Interrupt" edc:irq="170"/>
    <edc:Interrupt edc:cname="PWM_PRI" edc:desc="PWM Primary Event" edc:irq="171"/>
    <edc:Interrupt edc:cname="PWM_SEC" edc:desc="PWM Secondary Event" edc:irq="172"/>
    <edc:Interrupt edc:cname="PWM1" edc:desc="PWM 1 Interrupt" edc:irq="173"/>
    <edc:Interrupt edc:cname="PWM2" edc:desc="PWM 2 Interrupt" edc:irq="174"/>
    <edc:Interrupt edc:cname="PWM3" edc:desc="PWM 3 Interrupt" edc:irq="175"/>
    <edc:Interrupt edc:cname="PWM4" edc:desc="PWM 4 Interrupt" edc:irq="176"/>
    <edc:Interrupt edc:cname="PWM5" edc:desc="PWM 5 Interrupt" edc:irq="177"/>
    <edc:Interrupt edc:cname="PWM6" edc:desc="PWM 6 Interrupt" edc:irq="178"/>
    <edc:Interrupt edc:cname="DMA4" edc:desc="DMA Channel 4" edc:irq="182"/>
    <edc:Interrupt edc:cname="DMA5" edc:desc="DMA Channel 5" edc:irq="183"/>
    <edc:Interrupt edc:cname="DMA6" edc:desc="DMA Channel 6" edc:irq="184"/>
    <edc:Interrupt edc:cname="DMA7" edc:desc="DMA Channel 7" edc:irq="185"/>
    <edc:Interrupt edc:cname="QEI3" edc:desc="QEI 3 Interrupt" edc:irq="189"/>
    <edc:Interrupt edc:cname="SYSTEM_BUS_PROTECTION" edc:desc="System Bus Protection Violation" edc:irq="230"/>
    <edc:Interrupt edc:cname="PWM7" edc:desc="PWM 7 Interrupt" edc:irq="238"/>
    <edc:Interrupt edc:cname="PWM8" edc:desc="PWM 8 Interrupt" edc:irq="239"/>
    <edc:Interrupt edc:cname="PWM9" edc:desc="PWM 9 Interrupt" edc:irq="240"/>
    <edc:Interrupt edc:cname="ADC_DC3" edc:desc="ADC Digital Comparator 3" edc:irq="245"/>
    <edc:Interrupt edc:cname="ADC_DC4" edc:desc="ADC Digital Comparator 4" edc:irq="246"/>
    <edc:Interrupt edc:cname="PCACHE" edc:desc="P - Cache Event Interrupt" edc:irq="247"/>
    <edc:Interrupt edc:cname="CLC1" edc:irq="249"/>
    <edc:Interrupt edc:cname="CLC2" edc:irq="250"/>
    <edc:Interrupt edc:cname="CLC3" edc:irq="251"/>
    <edc:Interrupt edc:cname="CLC4" edc:irq="252"/>
    <edc:Interrupt edc:cname="CORE_PERF_COUNT" edc:desc="MPU Core Performance Counter Event" edc:irq="254"/>
    <edc:Interrupt edc:cname="CORE_FAST_DEBUG_CHAN" edc:desc="Core Fast Debug Channel" edc:irq="255"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasappinout="true" edc:hwbpcount="12"/>
  <edc:FPU/>
  <edc:ProjectionTable edc:ksegmask="0xFF000000">
    <edc:Projection edc:ksegval="0x00000000" edc:ptovop="XOR" edc:ptovval="0x00000000" edc:vtopop="XOR" edc:vtopval="0x00000000"/>
    <edc:Projection edc:ksegval="0x7D000000" edc:ptovop="XOR" edc:ptovval="0x60000000" edc:vtopop="XOR" edc:vtopval="0x60000000"/>
    <edc:Projection edc:ksegval="0x80000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0x9D000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0x9F000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0xA0000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xBD000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xBF000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
  </edc:ProjectionTable>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="zero" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="zero" edc:nmmrflags="St" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="at" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="at" edc:nmmrflags="St" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="at" edc:desc="" edc:mask="0xffffffff" edc:name="at" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
