Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="r-------------------------------" edc:cname="Config2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config2" edc:nmmrflags="0b" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="448">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r-------rrrrrrrnrrrrrr-r-rrrr--r" edc:cname="Config3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000101000101011110101101000" edc:name="Config3" edc:nmmrflags="0c" edc:nzwidth="0x20" edc:por="10000000101000101011110101101000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="576">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TL" edc:desc="" edc:mask="0x1" edc:name="TL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CDMM" edc:desc="" edc:mask="0x1" edc:name="CDMM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SP" edc:desc="" edc:mask="0x1" edc:name="SP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VInt" edc:desc="" edc:mask="0x1" edc:name="VInt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VEIC" edc:desc="" edc:mask="0x1" edc:name="VEIC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ITL" edc:desc="" edc:mask="0x1" edc:name="ITL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DSPP" edc:desc="" edc:mask="0x1" edc:name="DSPP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSP2P" edc:desc="" edc:mask="0x1" edc:name="DSP2P" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXI" edc:desc="" edc:mask="0x1" edc:name="RXI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ULRI" edc:desc="" edc:mask="0x1" edc:name="ULRI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISA" edc:desc="" edc:mask="0x3" edc:name="ISA" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ISAONEXC" edc:desc="" edc:mask="0x1" edc:name="ISAONEXC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCU" edc:desc="" edc:mask="0x1" edc:name="MCU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MMAR" edc:desc="" edc:mask="0x7" edc:name="MMAR" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="IPLW" edc:desc="" edc:mask="0x3" edc:name="IPLW" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="VZ" edc:desc="" edc:mask="0x1" edc:name="VZ" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r-------------------------------" edc:cname="Config4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config4" edc:nmmrflags="0d" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="704">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r----------------------------n-r" edc:cname="Config5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000001" edc:name="Config5" edc:nmmrflags="0e" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="832">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NF" edc:desc="" edc:mask="0x1" edc:name="NF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="UFR" edc:desc="" edc:mask="0x1" edc:name="UFR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="28"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r------------r------------------" edc:cname="Config7" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config7" edc:nmmrflags="0" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="1088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="HCI" edc:desc="" edc:mask="0x1" edc:name="HCI" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="12"/>
            <edc:SFRFieldDef edc:cname="WII" edc:desc="" edc:mask="0x1" edc:name="WII" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----rrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="LLAddr" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="LLAddr" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="196">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PAddr" edc:desc="" edc:mask="0xfffffff" edc:name="DSS" edc:nzwidth="0x1C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo1" edc:nmmrflags="0a" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="328">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo2" edc:nmmrflags="0b" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="456">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo3" edc:nmmrflags="0c" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="584">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="WatchHi" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="204">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="WatchHi1" edc:nmmrflags="0a" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="332">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="WatchHi2" edc:nmmrflags="0b" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="460">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchHi3" edc:nmmrflags="0c" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="588">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrnrrnn--nnrrrrrrrrrrrn-rrrrrrr" edc:cname="Debug" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000010000000101000000000000000" edc:name="Debug" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000010000000101000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="220">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSS" edc:desc="" edc:mask="0x1" edc:name="DSS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBp" edc:desc="" edc:mask="0x1" edc:name="DBp" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDBL" edc:desc="" edc:mask="0x1" edc:name="DDBL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDBS" edc:desc="" edc:mask="0x1" edc:name="DDBS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIB" edc:desc="" edc:mask="0x1" edc:name="DIB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DINT" edc:desc="" edc:mask="0x1" edc:name="DINT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIBIMPR" edc:desc="" edc:mask="0x1" edc:name="DIBIMPR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SSt" edc:desc="" edc:mask="0x1" edc:name="SSt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NoSST" edc:desc="" edc:mask="0x1" edc:name="NoSST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DExcCode" edc:desc="" edc:mask="0x1f" edc:name="DExcCode" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="Ver" edc:desc="" edc:mask="0x7" edc:name="Ver" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DDBLImpr" edc:desc="" edc:mask="0x1" edc:name="DDBLImpr" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDBSImpr" edc:desc="" edc:mask="0x1" edc:name="DDBSImpr" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEXI" edc:desc="" edc:mask="0x1" edc:name="IEXI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBusEP" edc:desc="" edc:mask="0x1" edc:name="DBusEP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="IBusEP" edc:desc="" edc:mask="0x1" edc:name="IBusEP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CountDM" edc:desc="" edc:mask="0x1" edc:name="CountDM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Halt" edc:desc="" edc:mask="0x1" edc:name="Halt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Doze" edc:desc="" edc:mask="0x1" edc:name="Doze" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSNM" edc:desc="" edc:mask="0x1" edc:name="LSNM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NoDCR" edc:desc="" edc:mask="0x1" edc:name="NoDCR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DM" edc:desc="" edc:mask="0x1" edc:name="DM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBD" edc:desc="" edc:mask="0x1" edc:name="DBD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
