Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f15" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f15" edc:nmmrflags="St" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="1400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f15" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f15" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f16" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f16" edc:nmmrflags="St" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="1408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f16" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f16" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f17" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f17" edc:nmmrflags="St" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="1416">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f17" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f17" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f18" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f18" edc:nmmrflags="St" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="1424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f18" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f18" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f19" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f19" edc:nmmrflags="St" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="1432">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f19" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f19" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f20" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f20" edc:nmmrflags="St" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="1440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f20" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f20" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f21" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f21" edc:nmmrflags="St" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="1448">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f21" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f21" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f22" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f22" edc:nmmrflags="St" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="1456">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f22" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f22" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f23" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f23" edc:nmmrflags="St" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="1464">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f23" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f23" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f24" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f24" edc:nmmrflags="St" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="1472">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f24" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f24" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
