Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BF1SEQ" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:name="BF1SEQ" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff" edc:default="0xffffffff" edc:_addr="0x1FC43FF0">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="TSEQ" edc:desc="Boot Flash True Sequence Number" edc:mask="0xffff" edc:name="TSEQ" edc:nzwidth="16"/>
            <edc:DCRFieldDef edc:cname="CSEQ" edc:desc="Boot Flash Complement Sequence Number" edc:mask="0xffff" edc:name="CSEQ" edc:nzwidth="16"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:AltConfigFuseSector>
    <edc:BootConfigSector edc:beginaddr="0x1fc44000" edc:endaddr="0x1fc45000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot1lastpage"/>
    <edc:ConfigFuseSector edc:beginaddr="0x1fc45000" edc:endaddr="0x1fc4501c" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="adccal">
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC0" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC0" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000" edc:default="0xffffffff" edc:_addr="0x1FC45000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC1" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000" edc:default="0xffffffff" edc:_addr="0x1FC45004">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC2" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000" edc:default="0xffffffff" edc:_addr="0x1FC45008">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC3" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000" edc:default="0xffffffff" edc:_addr="0x1FC4500C">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC4" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC4" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000" edc:default="0xffffffff" edc:_addr="0x1FC45010">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC5" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC5" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000" edc:default="0xffffffff" edc:_addr="0x1FC45014">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC7" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC7" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000" edc:default="0xffffffff" edc:_addr="0x1FC45018">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:ConfigFuseSector edc:beginaddr="0x1fc45020" edc:endaddr="0x1fc45030" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="serial">
      <edc:DCRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN0" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVSN0" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000" edc:default="0xffffffff" edc:_addr="0x1FC45020">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN1" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVSN1" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000" edc:default="0xffffffff" edc:_addr="0x1FC45024">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN2" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVSN2" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000" edc:default="0xffffffff" edc:_addr="0x1FC45028">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN3" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVSN3" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000" edc:default="0xffffffff" edc:_addr="0x1FC4502C">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:beginaddr="0x00000000" edc:endaddr="0x00010000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="1" edc:kuseg="0x0000000" edc:regionid="kseg0_data_mem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f802000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb1_std">
      <edc:SFRDef edc:access="-----n--nnnnnnnn--nnn---n-nnnn-n" edc:cname="CFGCON" edc:desc="" edc:impl="0xfc19f9" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0--uuuuuu00--000---0-uu00-1" edc:name="CFGCON" edc:nzwidth="0x20" edc:por="-----0--xxxxxx00--000---0-xx00-1" edc:portals="- - -" ltx:baseofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x1F800000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TDOEN" edc:desc="" edc:mask="0x1" edc:name="TDOEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TROEN" edc:desc="" edc:mask="0x1" edc:name="TROEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="JTAGEN" edc:desc="" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ECCCON" edc:desc="Flash ECC Configuration Bits" edc:mask="0x3" edc:name="ECCCON" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IOANCPEN" edc:mask="0x1" edc:name="IOANCPEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PGLOCK" edc:desc="" edc:mask="0x1" edc:name="PGLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PMDLOCK" edc:desc="" edc:mask="0x1" edc:name="PMDLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IOLOCK" edc:desc="" edc:mask="0x1" edc:name="IOLOCK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="OCACLK" edc:desc="" edc:mask="0x1" edc:name="OCACLK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICACLK" edc:desc="" edc:mask="0x1" edc:name="ICACLK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN1" edc:desc="PWM Alternate I/O Pin Select" edc:mask="0x1" edc:name="PWMAPIN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN2" edc:desc="PWM Alternate I/O Pin Select" edc:mask="0x1" edc:name="PWMAPIN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN3" edc:desc="PWM Alternate I/O Pin Select" edc:mask="0x1" edc:name="PWMAPIN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN4" edc:desc="PWM Alternate I/O Pin Select" edc:mask="0x1" edc:name="PWMAPIN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN5" edc:desc="PWM Alternate I/O Pin Select" edc:mask="0x1" edc:name="PWMAPIN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWAPIN6" edc:desc="PWM Alternate I/O Pin Select" edc:mask="0x1" edc:name="PWAPIN6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCPRI" edc:desc="" edc:mask="0x1" edc:name="ADCPRI" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F800010"/>
      <edc:SFRDef edc:access="rrrrnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVID" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DEVID" edc:nzwidth="0x20" edc:por="0000xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:_begin="0x20" edc:_end="0xb0" edc:_addr="0x1F800020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEVID" edc:desc="" edc:mask="0xfffffff" edc:name="DEVID" edc:nzwidth="28"/>
            <edc:SFRFieldDef edc:cname="VER" edc:desc="" edc:mask="0xf" edc:name="VER" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYSKEY" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SYSKEY" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="- - -" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:_begin="0x20" edc:_end="0xb0" edc:_addr="0x1F800030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SYSKEY" edc:desc="" edc:mask="0xffffffff" edc:name="SYSKEY" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------nn-nnn---n" edc:cname="PMD1" edc:desc="" edc:impl="0x371" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------uu-uuu---0" edc:name="PMD1" edc:nzwidth="0x20" edc:por="----------------------xx-xxx---0" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:_begin="0x20" edc:_end="0xb0" edc:_addr="0x1F800040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DAC1MD" edc:mask="0x1" edc:name="DAC1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC2MD" edc:mask="0x1" edc:name="DAC2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC3MD" edc:mask="0x1" edc:name="DAC3MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CTMUMD" edc:mask="0x1" edc:name="CTMUMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EEMD" edc:mask="0x1" edc:name="EEMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xa"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
