Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="-----------n-nnn-----------nnnnn" edc:cname="PMD2" edc:desc="" edc:impl="0x17001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------u-uuu-----------uuu00" edc:name="PMD2" edc:nzwidth="0x20" edc:por="-----------x-xxx-----------xxx00" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:_begin="0x20" edc:_end="0xb0" edc:_addr="0x1F800050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP3MD" edc:desc="" edc:mask="0x1" edc:name="CMP3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP4MD" edc:desc="" edc:mask="0x1" edc:name="CMP4MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP5MD" edc:desc="" edc:mask="0x1" edc:name="CMP5MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="OPA1MD" edc:desc="" edc:mask="0x1" edc:name="OPA1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPA2MD" edc:desc="" edc:mask="0x1" edc:name="OPA2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPA3MD" edc:desc="" edc:mask="0x1" edc:name="OPA3MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OPA5MD" edc:mask="0x1" edc:name="OPA5MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMD3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuu000000000uuuuuuu000000000" edc:name="PMD3" edc:nzwidth="0x20" edc:por="xxxxxxx000000000xxxxxxx000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:_begin="0x20" edc:_end="0xb0" edc:_addr="0x1F800060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC1MD" edc:desc="" edc:mask="0x1" edc:name="IC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2MD" edc:desc="" edc:mask="0x1" edc:name="IC2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3MD" edc:desc="" edc:mask="0x1" edc:name="IC3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4MD" edc:desc="" edc:mask="0x1" edc:name="IC4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5MD" edc:desc="" edc:mask="0x1" edc:name="IC5MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6MD" edc:desc="" edc:mask="0x1" edc:name="IC6MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7MD" edc:desc="" edc:mask="0x1" edc:name="IC7MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8MD" edc:desc="" edc:mask="0x1" edc:name="IC8MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9MD" edc:desc="" edc:mask="0x1" edc:name="IC9MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC10MD" edc:mask="0x1" edc:name="IC10MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC11MD" edc:mask="0x1" edc:name="IC11MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC12MD" edc:mask="0x1" edc:name="IC12MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC13MD" edc:mask="0x1" edc:name="IC13MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC14MD" edc:mask="0x1" edc:name="IC14MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC15MD" edc:mask="0x1" edc:name="IC15MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC16MD" edc:mask="0x1" edc:name="IC16MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC1MD" edc:desc="" edc:mask="0x1" edc:name="OC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2MD" edc:desc="" edc:mask="0x1" edc:name="OC2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3MD" edc:desc="" edc:mask="0x1" edc:name="OC3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4MD" edc:desc="" edc:mask="0x1" edc:name="OC4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5MD" edc:desc="" edc:mask="0x1" edc:name="OC5MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC6MD" edc:desc="" edc:mask="0x1" edc:name="OC6MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC7MD" edc:desc="" edc:mask="0x1" edc:name="OC7MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC8MD" edc:desc="" edc:mask="0x1" edc:name="OC8MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC9MD" edc:desc="" edc:mask="0x1" edc:name="OC9MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC10MD" edc:mask="0x1" edc:name="OC10MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC11MD" edc:mask="0x1" edc:name="OC11MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC12MD" edc:mask="0x1" edc:name="OC12MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC13MD" edc:mask="0x1" edc:name="OC13MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC14MD" edc:mask="0x1" edc:name="OC14MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC15MD" edc:mask="0x1" edc:name="OC15MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC16MD" edc:mask="0x1" edc:name="OC16MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnnnnnnnnnnn-------nnnnnnnnn" edc:cname="PMD4" edc:desc="" edc:impl="0xfff01ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu-------000000000" edc:name="PMD4" edc:nzwidth="0x20" edc:por="----xxxxxxxxxxxx-------111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:_begin="0x20" edc:_end="0xb0" edc:_addr="0x1F800070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T1MD" edc:desc="" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2MD" edc:desc="" edc:mask="0x1" edc:name="T2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3MD" edc:desc="" edc:mask="0x1" edc:name="T3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4MD" edc:desc="" edc:mask="0x1" edc:name="T4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5MD" edc:desc="" edc:mask="0x1" edc:name="T5MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6MD" edc:desc="" edc:mask="0x1" edc:name="T6MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T7MD" edc:desc="" edc:mask="0x1" edc:name="T7MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T8MD" edc:desc="" edc:mask="0x1" edc:name="T8MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T9MD" edc:desc="" edc:mask="0x1" edc:name="T9MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PWM1MD" edc:mask="0x1" edc:name="PWM1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM2MD" edc:mask="0x1" edc:name="PWM2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM3MD" edc:mask="0x1" edc:name="PWM3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM4MD" edc:mask="0x1" edc:name="PWM4MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM5MD" edc:mask="0x1" edc:name="PWM5MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM6MD" edc:mask="0x1" edc:name="PWM6MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM7MD" edc:mask="0x1" edc:name="PWM7MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM8MD" edc:mask="0x1" edc:name="PWM8MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM9MD" edc:mask="0x1" edc:name="PWM9MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM10MD" edc:mask="0x1" edc:name="PWM10MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM11MD" edc:mask="0x1" edc:name="PWM11MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM12MD" edc:mask="0x1" edc:name="PWM12MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnn--nn----nnnn--nnnnnn--nnnnnn" edc:cname="PMD5" edc:desc="" edc:impl="0xf30f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu0--uu----uu00--uuuu00--uuuu00" edc:name="PMD5" edc:nzwidth="0x20" edc:por="xxx0--xx----xx00--xxxx00--xxxx00" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:_begin="0x20" edc:_end="0xb0" edc:_addr="0x1F800080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3MD" edc:mask="0x1" edc:name="U3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U4MD" edc:mask="0x1" edc:name="U4MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U5MD" edc:mask="0x1" edc:name="U5MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U6MD" edc:mask="0x1" edc:name="U6MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3MD" edc:mask="0x1" edc:name="SPI3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4MD" edc:mask="0x1" edc:name="SPI4MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI5MD" edc:mask="0x1" edc:name="SPI5MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI6MD" edc:mask="0x1" edc:name="SPI6MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="I2C1MD" edc:desc="" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MD" edc:desc="" edc:mask="0x1" edc:name="I2C2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3MD" edc:mask="0x1" edc:name="I2C3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4MD" edc:mask="0x1" edc:name="I2C4MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="USB1MD" edc:mask="0x1" edc:name="USB1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USB2MD" edc:mask="0x1" edc:name="USB2MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CAN1MD" edc:desc="" edc:mask="0x1" edc:name="CAN1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN2MD" edc:mask="0x1" edc:name="CAN2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN3MD" edc:mask="0x1" edc:name="CAN3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN4MD" edc:mask="0x1" edc:name="CAN4MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnnn----nn-n----nnnn-------n" edc:cname="PMD6" edc:desc="" edc:impl="0x1fbf1f01" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu----uu-u----0000-------0" edc:name="PMD6" edc:nzwidth="0x20" edc:por="----xxxx----xx-x----0000-------0" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:_begin="0x20" edc:_end="0xb0" edc:_addr="0x1F800090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="REFO1MD" edc:desc="" edc:mask="0x1" edc:name="REFO1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO2MD" edc:desc="" edc:mask="0x1" edc:name="REFO2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO3MD" edc:desc="" edc:mask="0x1" edc:name="REFO3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO4MD" edc:desc="" edc:mask="0x1" edc:name="REFO4MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PMPMD" edc:mask="0x1" edc:name="PMPMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI5MD" edc:mask="0x1" edc:name="QEI5MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI6MD" edc:mask="0x1" edc:name="QEI6MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="QEI1MD" edc:mask="0x1" edc:name="QEI1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI2MD" edc:mask="0x1" edc:name="QEI2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI3MD" edc:mask="0x1" edc:name="QEI3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI4MD" edc:mask="0x1" edc:name="QEI4MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------n----" edc:cname="PMD7" edc:desc="" edc:impl="0x10" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------0----" edc:name="PMD7" edc:nzwidth="0x20" edc:por="---------------------------0----" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:_begin="0x20" edc:_end="0xb0" edc:_addr="0x1F8000A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DMAMD" edc:desc="" edc:mask="0x1" edc:name="DMAMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="15"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="48" edc:_addr="0x1F8000B0"/>
      <edc:SFRDef edc:access="------nnnn--------nn------nn--nn" edc:cname="CFGPG" edc:desc="" edc:impl="0x3c03033" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000--------00------00--00" edc:name="CFGPG" edc:nzwidth="32" edc:por="------0000--------00------00--00" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="3" edc:_begin="0xe0" edc:_end="0x114" edc:_addr="0x1F8000E0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CPUPG" edc:desc="" edc:mask="0x3" edc:name="CPUPG" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="DMAPG" edc:desc="" edc:mask="0x3" edc:name="DMAPG" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CAN1PG" edc:desc="" edc:mask="0x3" edc:name="CAN1PG" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="FCPG" edc:desc="" edc:mask="0x3" edc:name="FCPG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCPG" edc:desc="" edc:mask="0x3" edc:name="ADCPG" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="3" edc:_begin="0xe0" edc:_end="0x114" edc:_addr="0x1F8000F0"/>
      <edc:SFRDef edc:access="----------n---------------------" edc:cname="CFGAPP2" edc:desc="" edc:impl="0x200000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------u---------------------" edc:name="CFGAPP2" edc:nzwidth="32" edc:por="----------x---------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="3" edc:_begin="0xe0" edc:_end="0x114" edc:_addr="0x1F800100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="POSCFAIL" edc:desc="Primary Oscillator Unable to Lock Status Read-only bit" edc:mask="0x1" edc:name="POSCFAIL" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Crystal or Resonator usage failed" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Crystal or resonator is locked or is indeterminate. If successfully locked, clock status is determined bythe SPLLRDY (CLKSTAT&lt;7&gt;) status flag." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------nnnnnnnn" edc:cname="CFGCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------uuuuuuuu" edc:name="CFGCON2" edc:nzwidth="32" edc:por="------------------------xxxxxxxx" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="3" edc:_begin="0xe0" edc:_end="0x114" edc:_addr="0x1F800110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EEWS" edc:desc="Read Access Count bits" edc:mask="0xff" edc:name="EEWS" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x6EC" edc:_addr="0x1F800114"/>
      <edc:SFRDef edc:access="-----nnn-nnn-nnn---n---nn-nnnnnn" edc:cname="CHECON" edc:desc="" edc:grp="PCACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111-000-000---0---1u-00uuuu" edc:name="CHECON" edc:nzwidth="0x20" edc:por="-----111-000-000---0---1x-00xxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PCACHE" edc:_modsrc="DOS-03088_pfm_cache_ocp_v2_WACK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x40" edc:_addr="0x1F800800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFMWS" edc:mask="0xf" edc:name="PFMWS" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PREFEN" edc:desc="" edc:mask="0x3" edc:name="PREFEN" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFMSECEN" edc:mask="0x1" edc:name="PFMSECEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFMAWSEN" edc:mask="0x1" edc:name="PFMAWSEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CHEPERFEN" edc:mask="0x1" edc:name="CHEPERFEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ICHECOH" edc:mask="0x1" edc:name="ICHECOH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCHECOH" edc:mask="0x1" edc:name="DCHECOH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERCHECOH" edc:mask="0x1" edc:name="PERCHECOH" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICHEINV" edc:mask="0x1" edc:name="ICHEINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCHEINV" edc:mask="0x1" edc:name="DCHEINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERCHEINV" edc:mask="0x1" edc:name="PERCHEINV" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICHEEN" edc:mask="0x1" edc:name="ICHEEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCHEEN" edc:mask="0x1" edc:name="DCHEEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERCHEEN" edc:mask="0x1" edc:name="PERCHEEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nn------------------nnnnnnnn" edc:cname="CHESTAT" edc:desc="" edc:impl="0xc0000ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uu------------------uuuuuuuu" edc:name="CHESTAT" edc:nzwidth="32" edc:por="----xx------------------xxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="PCACHE" edc:_modsrc="DOS-03088_pfm_cache_ocp_v2_WACK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x40" edc:_addr="0x1F800810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFMSECCNT" edc:mask="0xff" edc:name="PFMSECCNT" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="PFMSEC" edc:mask="0x1" edc:name="PFMSEC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFMDED" edc:mask="0x1" edc:name="PFMDED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
