Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="--------------------------nnnnnn" edc:cname="OSCTUN" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000000" edc:name="OSCTUN" edc:nzwidth="32" edc:por="--------------------------000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x40" edc:_addr="0x1F801210">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TUN" edc:desc="" edc:mask="0x3f" edc:name="TUN" edc:nzwidth="6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----nnn-nnnnnnn-----nnnn----nnn" edc:cname="SPLLCON" edc:desc="" edc:impl="0x77f0787" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----001-xxxxxxx-----xxx0----xxx" edc:name="SPLLCON" edc:nzwidth="32" edc:por="-----001-xxxxxxx-----xxx0----xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x40" edc:_addr="0x1F801220">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PLLRANGE" edc:desc="" edc:mask="0x7" edc:name="PLLRANGE" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PLLICLK" edc:desc="" edc:mask="0x1" edc:name="PLLICLK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PLLIDIV" edc:desc="" edc:mask="0x7" edc:name="PLLIDIV" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="PLLMULT" edc:desc="" edc:mask="0x7f" edc:name="PLLMULT" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PLLODIV" edc:desc="" edc:mask="0x7" edc:name="PLLODIV" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--n--nnn-nnnnnnn-----nnn-----nnn" edc:cname="UPLLCON" edc:desc="" edc:impl="0x277f0707" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u--001-xxxxxxx-----001-----xxx" edc:name="UPLLCON" edc:nzwidth="32" edc:por="--x--001-xxxxxxx-----001-----xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x40" edc:_addr="0x1F801230">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PLLRANGE" edc:desc="" edc:mask="0x7" edc:name="PLLRANGE" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="PLLIDIV" edc:desc="" edc:mask="0x7" edc:name="PLLIDIV" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="PLLMULT" edc:desc="" edc:mask="0x7f" edc:name="PLLMULT" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PLLODIV" edc:desc="" edc:mask="0x7" edc:name="PLLODIV" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UPOSCEN" edc:mask="0x1" edc:name="UPOSCEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nn--nn---------------nn-nnnnnnnn" edc:cname="RCON" edc:desc="" edc:impl="0xcc0006ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--uu---------------u0-00000000" edc:name="RCON" edc:nzwidth="32" edc:por="00--xx---------------x0-00000011" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU" edc:_modsrc="DOS-02823_WACN_clk_cru_upb_v2.Module" edc:_refcount="1" edc:_begin="0x50" edc:_end="0x90" edc:_addr="0x1F801240">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BOR" edc:desc="" edc:mask="0x1" edc:name="BOR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMTO" edc:desc="" edc:mask="0x1" edc:name="DMTO" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CMR" edc:desc="" edc:mask="0x1" edc:name="CMR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DPSLP" edc:mask="0x1" edc:name="DPSLP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="VBAT" edc:desc="" edc:mask="0x1" edc:name="VBAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VBPOR" edc:mask="0x1" edc:name="VBPOR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BCFGFAIL" edc:desc="Primary/Secondary Configuration Registers Error Flag bit" edc:mask="0x1" edc:name="BCFGFAIL" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="An error occurred during a read of the primary and alternate configuration registers" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="No error occurred during a read of the primary and alternate configuration registers" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BCFGERR" edc:desc="Primary Configuration Registers Error Flag bit" edc:mask="0x1" edc:name="BCFGERR" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="An error occurred during a read of the primary configuration registers" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="No error occurred during a read of the primary configuration registers" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PORCORE" edc:mask="0x1" edc:name="PORCORE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORIO" edc:mask="0x1" edc:name="PORIO" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------------------w" edc:cname="RSWRST" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="RSWRST" edc:nzwidth="32" edc:por="-------------------------------0" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU" edc:_modsrc="DOS-02823_WACN_clk_cru_upb_v2.Module" edc:_refcount="1" edc:_begin="0x50" edc:_end="0x90" edc:_addr="0x1F801250">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="" edc:mask="0x1" edc:name="SWRST" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------nnn---n-nnnnnnnnnnnnnnnnnn" edc:cname="RNMICON" edc:desc="" edc:impl="0x38bffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0u0---0-000000000000000000" edc:name="RNMICON" edc:nzwidth="32" edc:por="------0x0---0-000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU" edc:_modsrc="DOS-02823_WACN_clk_cru_upb_v2.Module" edc:_refcount="1" edc:_begin="0x50" edc:_end="0x90" edc:_addr="0x1F801260">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NMICNT" edc:desc="" edc:mask="0xffff" edc:name="NMICNT" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="WDTS" edc:desc="" edc:mask="0x1" edc:name="WDTS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HLVD" edc:desc="" edc:mask="0x1" edc:name="HLVD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GNMI" edc:mask="0x1" edc:name="GNMI" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SWNMI" edc:desc="" edc:mask="0x1" edc:name="SWNMI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMTO" edc:desc="" edc:mask="0x1" edc:name="DMTO" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
