Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPD4R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPD4R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="40" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD4R" edc:desc="" edc:mask="0x1f" edc:name="RPD4R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPD5R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPD5R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="41" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD5R" edc:desc="" edc:mask="0x1f" edc:name="RPD5R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPD6R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPD6R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="42" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD6R" edc:desc="" edc:mask="0x1f" edc:name="RPD6R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x24" edc:_addr="0x1F8016DC"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPE0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPE0R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="43" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801700">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPE0R" edc:desc="" edc:mask="0x1f" edc:name="RPE0R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPE1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPE1R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="44" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801704">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPE1R" edc:desc="" edc:mask="0x1f" edc:name="RPE1R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0x1F801708"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPE14R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPE14R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="45" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801738">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPE14R" edc:desc="" edc:mask="0x1f" edc:name="RPE14R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPE15R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPE15R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="46" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80173C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPE15R" edc:desc="" edc:mask="0x1f" edc:name="RPE15R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPF0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPF0R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="47" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801740">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPF0R" edc:desc="" edc:mask="0x1f" edc:name="RPF0R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPF1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPF1R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="48" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801744">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPF1R" edc:desc="" edc:mask="0x1f" edc:name="RPF1R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
