Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PR1" edc:desc="" edc:grp="TMR1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000001111111111111111" edc:name="PR1" edc:nzwidth="0x20" edc:por="00000000000000001111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR1" edc:_modsrc="DOS-02141_tmr_classa_pb_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x30" edc:_addr="0x1F820020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="PR1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="464" edc:_addr="0x1F820030"/>
      <edc:SFRDef edc:access="----------------n-n----nnnnnn-n-" edc:cname="T2CON" edc:desc="Timer Configuration" edc:grp="TMR2" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000----u00000-0-" edc:name="T2CON" edc:nzwidth="0x20" edc:por="----------------000----x00000-0-" edc:portals="CLR SET INV" ltx:baseofperipheral="TMR2" edc:_modsrc="DOS-02815_tmr_classb_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x30" edc:_addr="0x1F820200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="Timer Clock Source Select bit" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="External clock from TxCK pin" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Internal peripheral clock" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="T32" edc:desc="32-Bit Timer Mode Select bit" edc:mask="0x1" edc:name="T32" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="32-bit Timer mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="16-bit Timer mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="Timer Input Clock Prescale Select bits" edc:mask="0x7" edc:name="TCKPS" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:desc="1:256 prescale value" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="1:64 prescale value" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="1:32 prescale value" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="1:16 prescale value" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="1:8 prescale value" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="1:4 prescale value" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="1:2 prescale value" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="1:1 prescale value" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TGATE" edc:desc="Timer Gated Time Accumulation Enable bit" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Gated time accumulation is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Gated time accumulation is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Synchronized Timer Start/Stop Enable bit" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Synchronized timer Start/Stop is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Synchronized timer Start/Stop is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="Stop in Idle Mode bit" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Discontinue operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Continue operation even in Idle mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="Timer On bit" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Module is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Module is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="TIMER2" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TMR2" edc:desc="Timer" edc:grp="TMR2" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TMR2" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR2" edc:_modsrc="DOS-02815_tmr_classb_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x30" edc:_addr="0x1F820210">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMR2" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="TMR2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PR2" edc:desc="Timer Period" edc:grp="PR2" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000001111111111111111" edc:name="PR2" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR2" edc:_modsrc="DOS-02815_tmr_classb_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x30" edc:_addr="0x1F820220">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PR2" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="PR2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="464" edc:_addr="0x1F820230"/>
      <edc:SFRDef edc:access="----------------n-n----nnnnnn-n-" edc:cname="T3CON" edc:desc="Timer Configuration" edc:grp="TMR3" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000----u00000-0-" edc:name="T3CON" edc:nzwidth="0x20" edc:por="----------------000----x00000-0-" edc:portals="CLR SET INV" ltx:baseofperipheral="TMR3" edc:_modsrc="DOS-02815_tmr_classb_upb_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x30" edc:_addr="0x1F820400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="Timer Clock Source Select bit" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="External clock from TxCK pin" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Internal peripheral clock" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="T32" edc:desc="32-Bit Timer Mode Select bit" edc:mask="0x1" edc:name="T32" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="32-bit Timer mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="16-bit Timer mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="Timer Input Clock Prescale Select bits" edc:mask="0x7" edc:name="TCKPS" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:desc="1:256 prescale value" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="1:64 prescale value" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="1:32 prescale value" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="1:16 prescale value" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="1:8 prescale value" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="1:4 prescale value" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="1:2 prescale value" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="1:1 prescale value" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TGATE" edc:desc="Timer Gated Time Accumulation Enable bit" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Gated time accumulation is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Gated time accumulation is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Synchronized Timer Start/Stop Enable bit" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Synchronized timer Start/Stop is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Synchronized timer Start/Stop is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="Stop in Idle Mode bit" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Discontinue operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Continue operation even in Idle mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="Timer On bit" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Module is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Module is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="TIMER3" edc:pos="14"/>
      </edc:SFRDef>
