Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:AdjustPoint edc:offset="0x1db0" edc:_addr="0x1F828250"/>
      <edc:SFRDef edc:access="----------------n-nnnn---nnnnnnn" edc:cname="PTCON" edc:desc="" edc:impl="0xbc7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0-0000---0000000" edc:name="PTCON" edc:nzwidth="32" edc:por="----------------0-0000---0000000" edc:portals="CLR SET INV" ltx:baseofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEVTPS" edc:mask="0xf" edc:name="SEVTPS" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PCLKDIV" edc:mask="0x7" edc:name="PCLKDIV" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWMRDY" edc:mask="0x1" edc:name="PWMRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEIEN" edc:mask="0x1" edc:name="SEIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SESTAT" edc:mask="0x1" edc:name="SESTAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTSIDL" edc:mask="0x1" edc:name="PTSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTEN" edc:mask="0x1" edc:name="PTEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTPER" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PTPER" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTPER" edc:mask="0xffff" edc:name="PTPER" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SEVTCMP" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SEVTCMP" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEVTCMP" edc:mask="0xffff" edc:name="SEVTCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PMTMR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PMTMR" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PMTMR" edc:mask="0xffff" edc:name="PMTMR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------nn----nnnnnnn" edc:cname="STCON" edc:desc="" edc:impl="0x187f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00----0000000" edc:name="STCON" edc:nzwidth="32" edc:por="-------------------00----0000000" edc:portals="CLR SET INV" ltx:memberofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEVTPS" edc:mask="0xf" edc:name="SEVTPS" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SCLKDIV" edc:mask="0x7" edc:name="SCLKDIV" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SSEIEN" edc:mask="0x1" edc:name="SSEIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSESTAT" edc:mask="0x1" edc:name="SSESTAT" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="STPER" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="STPER" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STPER" edc:mask="0xffff" edc:name="STPER" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SSEVTCMP" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SSEVTCMP" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SSEVTCMP" edc:mask="0xffff" edc:name="SSEVTCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
