Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="--nnnnnn-nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IOCON5" edc:desc="" edc:impl="0x3f7fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000-00000000000000000000000" edc:name="IOCON5" edc:nzwidth="32" edc:por="--000000-00000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="6" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A4D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OSYNC" edc:mask="0x1" edc:name="OSYNC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP" edc:mask="0x1" edc:name="SWAP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLDAT" edc:mask="0x3" edc:name="CLDAT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTDAT" edc:mask="0x3" edc:name="FLTDAT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRDAT" edc:mask="0x3" edc:name="OVRDAT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRENL" edc:mask="0x1" edc:name="OVRENL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRENH" edc:mask="0x1" edc:name="OVRENH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMOD" edc:mask="0x3" edc:name="PMOD" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="POLL" edc:mask="0x1" edc:name="POLL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POLH" edc:mask="0x1" edc:name="POLH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENL" edc:mask="0x1" edc:name="PENL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENH" edc:mask="0x1" edc:name="PENH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTMOD" edc:mask="0x3" edc:name="FLTMOD" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTPOL" edc:mask="0x1" edc:name="FLTPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTSRC" edc:mask="0xf" edc:name="FLTSRC" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLMOD" edc:mask="0x1" edc:name="CLMOD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLPOL" edc:mask="0x1" edc:name="CLPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLSRC" edc:mask="0xf" edc:name="CLSRC" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PDC5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PDC5" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="6" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A4E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PDC" edc:mask="0xffff" edc:name="PDC" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SDC5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SDC5" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="6" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A4F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDC" edc:mask="0xffff" edc:name="SDC" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PHASE5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PHASE5" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="6" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A500">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PHASE" edc:mask="0xffff" edc:name="PHASE" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DTR5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DTR5" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="6" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A510">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DTR" edc:mask="0xffff" edc:name="DTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ALTDTR5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ALTDTR5" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="6" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A520">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ALTDTR" edc:mask="0xffff" edc:name="ALTDTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------nnnnnnnnnnnnnn" edc:cname="DTCOMP5" edc:desc="" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00000000000000" edc:name="DTCOMP5" edc:nzwidth="32" edc:por="------------------00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="6" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A530">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COMP" edc:mask="0x3fff" edc:name="COMP" edc:nzwidth="0xe"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TRIG5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="TRIG5" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="6" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A540">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRGCMP" edc:mask="0xffff" edc:name="TRGCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
