Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="nnnnn---nnnnn---nn--nnn-nnnnn-n-" edc:cname="PWMCON6" edc:desc="" edc:impl="0xf8f8cefa" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000---00000---00--000-00000-0-" edc:name="PWMCON6" edc:nzwidth="32" edc:por="00000---00000---00--000-00000-0-" edc:portals="CLR SET INV" ltx:baseofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="7" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A5C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XPRES" edc:mask="0x1" edc:name="XPRES" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MTBS" edc:mask="0x1" edc:name="MTBS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTDIR" edc:mask="0x1" edc:name="PTDIR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTCP" edc:mask="0x1" edc:name="DTCP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTC" edc:mask="0x3" edc:name="DTC" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ITB" edc:mask="0x1" edc:name="ITB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECAM" edc:mask="0x3" edc:name="ECAM" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CLTSTAT" edc:mask="0x1" edc:name="CLTSTAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTSTAT" edc:mask="0x1" edc:name="FLTSTAT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWMHIEN" edc:mask="0x1" edc:name="PWMHIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMLIEN" edc:mask="0x1" edc:name="PWMLIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGIEN" edc:mask="0x1" edc:name="TRGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLIEN" edc:mask="0x1" edc:name="CLIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTIEN" edc:mask="0x1" edc:name="FLTIEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWMHIF" edc:mask="0x1" edc:name="PWMHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMLIF" edc:mask="0x1" edc:name="PWMLIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGIF" edc:mask="0x1" edc:name="TRGIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLIF" edc:mask="0x1" edc:name="CLIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTIF" edc:mask="0x1" edc:name="FLTIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn-nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IOCON6" edc:desc="" edc:impl="0x3f7fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000-00000000000000000000000" edc:name="IOCON6" edc:nzwidth="32" edc:por="--000000-00000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="7" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A5D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OSYNC" edc:mask="0x1" edc:name="OSYNC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP" edc:mask="0x1" edc:name="SWAP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLDAT" edc:mask="0x3" edc:name="CLDAT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTDAT" edc:mask="0x3" edc:name="FLTDAT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRDAT" edc:mask="0x3" edc:name="OVRDAT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRENL" edc:mask="0x1" edc:name="OVRENL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRENH" edc:mask="0x1" edc:name="OVRENH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMOD" edc:mask="0x3" edc:name="PMOD" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="POLL" edc:mask="0x1" edc:name="POLL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POLH" edc:mask="0x1" edc:name="POLH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENL" edc:mask="0x1" edc:name="PENL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENH" edc:mask="0x1" edc:name="PENH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTMOD" edc:mask="0x3" edc:name="FLTMOD" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTPOL" edc:mask="0x1" edc:name="FLTPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTSRC" edc:mask="0xf" edc:name="FLTSRC" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLMOD" edc:mask="0x1" edc:name="CLMOD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLPOL" edc:mask="0x1" edc:name="CLPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLSRC" edc:mask="0xf" edc:name="CLSRC" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PDC6" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PDC6" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="7" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A5E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PDC" edc:mask="0xffff" edc:name="PDC" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SDC6" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SDC6" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="7" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A5F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDC" edc:mask="0xffff" edc:name="SDC" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PHASE6" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PHASE6" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="7" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A600">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PHASE" edc:mask="0xffff" edc:name="PHASE" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DTR6" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DTR6" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="7" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A610">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DTR" edc:mask="0xffff" edc:name="DTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
