Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:AdjustPoint edc:offset="0x01d0" edc:_addr="0x1F82D630"/>
      <edc:SFRDef edc:access="------------nnnnnn--nn--nnn--nnn" edc:cname="CLC4CON" edc:desc="" edc:impl="0x200fcce7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------000000--00--000--000" edc:name="CLC4CON" edc:nzwidth="0x20" edc:por="------------000000--00--000--000" edc:portals="CLR SET INV" ltx:baseofperipheral="CLC4" edc:_modsrc="DOS-01577_cla_clc_upb_v1_32bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x30" edc:_addr="0x1F82D800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LCPOL" edc:desc="" edc:mask="0x1" edc:name="LCPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LCOUT" edc:desc="" edc:mask="0x1" edc:name="LCOUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LCOE" edc:desc="" edc:mask="0x1" edc:name="LCOE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1POL" edc:desc="" edc:mask="0x1" edc:name="G1POL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2POL" edc:desc="" edc:mask="0x1" edc:name="G2POL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3POL" edc:desc="" edc:mask="0x1" edc:name="G3POL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4POL" edc:desc="" edc:mask="0x1" edc:name="G4POL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CLC" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------nnn-nnn-nnn-nnn" edc:cname="CLC4SEL" edc:desc="" edc:impl="0x7777" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000-000-000-000" edc:name="CLC4SEL" edc:nzwidth="0x20" edc:por="-----------------000-000-000-000" edc:portals="CLR SET INV" ltx:memberofperipheral="CLC4" edc:_modsrc="DOS-01577_cla_clc_upb_v1_32bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x30" edc:_addr="0x1F82D810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DS1" edc:desc="" edc:mask="0x7" edc:name="DS1" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DS2" edc:desc="" edc:mask="0x7" edc:name="DS2" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DS3" edc:desc="" edc:mask="0x7" edc:name="DS3" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DS4" edc:desc="" edc:mask="0x7" edc:name="DS4" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLC4GLS" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CLC4GLS" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CLC4" edc:_modsrc="DOS-01577_cla_clc_upb_v1_32bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x30" edc:_addr="0x1F82D820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="G1D1N" edc:desc="" edc:mask="0x1" edc:name="G1D1N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D1T" edc:desc="" edc:mask="0x1" edc:name="G1D1T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D2N" edc:desc="" edc:mask="0x1" edc:name="G1D2N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D2T" edc:desc="" edc:mask="0x1" edc:name="G1D2T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D3N" edc:desc="" edc:mask="0x1" edc:name="G1D3N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D3T" edc:desc="" edc:mask="0x1" edc:name="G1D3T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D4N" edc:desc="" edc:mask="0x1" edc:name="G1D4N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D4T" edc:desc="" edc:mask="0x1" edc:name="G1D4T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D1N" edc:desc="" edc:mask="0x1" edc:name="G2D1N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D1T" edc:desc="" edc:mask="0x1" edc:name="G2D1T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D2N" edc:desc="" edc:mask="0x1" edc:name="G2D2N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D2T" edc:desc="" edc:mask="0x1" edc:name="G2D2T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D3N" edc:desc="" edc:mask="0x1" edc:name="G2D3N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D3T" edc:desc="" edc:mask="0x1" edc:name="G2D3T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D4N" edc:desc="" edc:mask="0x1" edc:name="G2D4N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D4T" edc:desc="" edc:mask="0x1" edc:name="G2D4T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D1N" edc:desc="" edc:mask="0x1" edc:name="G3D1N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D1T" edc:desc="" edc:mask="0x1" edc:name="G3D1T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D2N" edc:desc="" edc:mask="0x1" edc:name="G3D2N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D2T" edc:desc="" edc:mask="0x1" edc:name="G3D2T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D3N" edc:desc="" edc:mask="0x1" edc:name="G3D3N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D3T" edc:desc="" edc:mask="0x1" edc:name="G3D3T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D4N" edc:desc="" edc:mask="0x1" edc:name="G3D4N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D4T" edc:desc="" edc:mask="0x1" edc:name="G3D4T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D1N" edc:desc="" edc:mask="0x1" edc:name="G4D1N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D1T" edc:desc="" edc:mask="0x1" edc:name="G4D1T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D2N" edc:desc="" edc:mask="0x1" edc:name="G4D2N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D2T" edc:desc="" edc:mask="0x1" edc:name="G4D2T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D3N" edc:desc="" edc:mask="0x1" edc:name="G4D3N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D3T" edc:desc="" edc:mask="0x1" edc:name="G4D3T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D4N" edc:desc="" edc:mask="0x1" edc:name="G4D4N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D4T" edc:desc="" edc:mask="0x1" edc:name="G4D4T" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f840000" edc:endaddr="0x1f84C800" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb3_std"/>
    <edc:SFRDataSector edc:beginaddr="0x1f860000" edc:endaddr="0x1f860700" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb4_std">
      <edc:SFRDef edc:access="----------------nn-nn--n---n--nn" edc:cname="ANSELA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffd913" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------11-11--1---1--11" edc:name="ANSELA" edc:nzwidth="0x20" edc:por="----------------11-11--1---1--11" edc:portals="CLR SET INV" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA8" edc:desc="" edc:mask="0x1" edc:name="ANSA8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA11" edc:desc="" edc:mask="0x1" edc:name="ANSA11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA12" edc:desc="" edc:mask="0x1" edc:name="ANSA12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA14" edc:desc="" edc:mask="0x1" edc:name="ANSA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA15" edc:desc="" edc:mask="0x1" edc:name="ANSA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nn-nnn-nn--n--nn" edc:cname="TRISA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffdd93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------11-111-11--1--11" edc:name="TRISA" edc:nzwidth="0x20" edc:por="----------------11-111-11--1--11" edc:portals="CLR SET INV" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISA7" edc:desc="" edc:mask="0x1" edc:name="TRISA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA8" edc:desc="" edc:mask="0x1" edc:name="TRISA8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISA10" edc:desc="" edc:mask="0x1" edc:name="TRISA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA11" edc:desc="" edc:mask="0x1" edc:name="TRISA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISA12" edc:desc="" edc:mask="0x1" edc:name="TRISA12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISA14" edc:desc="" edc:mask="0x1" edc:name="TRISA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA15" edc:desc="" edc:mask="0x1" edc:name="TRISA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nn-nnn-nn--n--nn" edc:cname="PORTA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffdd93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xx-xxx-xx--x--xx" edc:name="PORTA" edc:nzwidth="0x20" edc:por="----------------xx-xxx-xx--x--xx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA7" edc:desc="" edc:mask="0x1" edc:name="RA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA8" edc:desc="" edc:mask="0x1" edc:name="RA8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA10" edc:desc="" edc:mask="0x1" edc:name="RA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA11" edc:desc="" edc:mask="0x1" edc:name="RA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RA12" edc:desc="" edc:mask="0x1" edc:name="RA12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA14" edc:desc="" edc:mask="0x1" edc:name="RA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA15" edc:desc="" edc:mask="0x1" edc:name="RA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nn-nnn-nn--n--nn" edc:cname="LATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffdd93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xx-xxx-xx--x--xx" edc:name="LATA" edc:nzwidth="0x20" edc:por="----------------xx-xxx-xx--x--xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA7" edc:desc="" edc:mask="0x1" edc:name="LATA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA8" edc:desc="" edc:mask="0x1" edc:name="LATA8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA10" edc:desc="" edc:mask="0x1" edc:name="LATA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA11" edc:desc="" edc:mask="0x1" edc:name="LATA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATA12" edc:desc="" edc:mask="0x1" edc:name="LATA12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA14" edc:desc="" edc:mask="0x1" edc:name="LATA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA15" edc:desc="" edc:mask="0x1" edc:name="LATA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
