Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="----------------nn-nnn-nn--n--nn" edc:cname="ODCA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffdd93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00-000-00--0--00" edc:name="ODCA" edc:nzwidth="0x20" edc:por="----------------00-000-00--0--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCA0" edc:desc="" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA1" edc:desc="" edc:mask="0x1" edc:name="ODCA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCA4" edc:desc="" edc:mask="0x1" edc:name="ODCA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCA7" edc:desc="" edc:mask="0x1" edc:name="ODCA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA8" edc:desc="" edc:mask="0x1" edc:name="ODCA8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCA10" edc:desc="" edc:mask="0x1" edc:name="ODCA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA11" edc:desc="" edc:mask="0x1" edc:name="ODCA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCA12" edc:desc="" edc:mask="0x1" edc:name="ODCA12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCA14" edc:desc="" edc:mask="0x1" edc:name="ODCA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA15" edc:desc="" edc:mask="0x1" edc:name="ODCA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nn-nnn-nn--n--nn" edc:cname="CNPUA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffdd93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00-000-00--0--00" edc:name="CNPUA" edc:nzwidth="0x20" edc:por="----------------00-000-00--0--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUA0" edc:desc="" edc:mask="0x1" edc:name="CNPUA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA1" edc:desc="" edc:mask="0x1" edc:name="CNPUA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUA4" edc:desc="" edc:mask="0x1" edc:name="CNPUA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUA7" edc:desc="" edc:mask="0x1" edc:name="CNPUA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA8" edc:desc="" edc:mask="0x1" edc:name="CNPUA8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUA10" edc:desc="" edc:mask="0x1" edc:name="CNPUA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA11" edc:desc="" edc:mask="0x1" edc:name="CNPUA11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA12" edc:desc="" edc:mask="0x1" edc:name="CNPUA12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUA14" edc:desc="" edc:mask="0x1" edc:name="CNPUA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA15" edc:desc="" edc:mask="0x1" edc:name="CNPUA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nn-nnn-nn--n--nn" edc:cname="CNPDA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffdd93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00-000-00--0--00" edc:name="CNPDA" edc:nzwidth="0x20" edc:por="----------------00-000-00--0--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDA0" edc:desc="" edc:mask="0x1" edc:name="CNPDA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA1" edc:desc="" edc:mask="0x1" edc:name="CNPDA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDA4" edc:desc="" edc:mask="0x1" edc:name="CNPDA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDA7" edc:desc="" edc:mask="0x1" edc:name="CNPDA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA8" edc:desc="" edc:mask="0x1" edc:name="CNPDA8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDA10" edc:desc="" edc:mask="0x1" edc:name="CNPDA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA11" edc:desc="" edc:mask="0x1" edc:name="CNPDA11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA12" edc:desc="" edc:mask="0x1" edc:name="CNPDA12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDA14" edc:desc="" edc:mask="0x1" edc:name="CNPDA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA15" edc:desc="" edc:mask="0x1" edc:name="CNPDA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n---n-----------" edc:cname="CNCONA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONA" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE A" edc:pos="14"/>
      </edc:SFRDef>
