Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="----------------nnnn--nn------nn" edc:cname="ODCE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--00------00" edc:name="ODCE" edc:nzwidth="0x20" edc:por="----------------0000--00------00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCE0" edc:desc="" edc:mask="0x1" edc:name="ODCE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE1" edc:desc="" edc:mask="0x1" edc:name="ODCE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCE8" edc:desc="" edc:mask="0x1" edc:name="ODCE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCE9" edc:desc="" edc:mask="0x1" edc:name="ODCE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCE12" edc:desc="" edc:mask="0x1" edc:name="ODCE12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCE13" edc:desc="" edc:mask="0x1" edc:name="ODCE13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCE14" edc:desc="" edc:mask="0x1" edc:name="ODCE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE15" edc:desc="" edc:mask="0x1" edc:name="ODCE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnn--nn------nn" edc:cname="CNPUE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--00------00" edc:name="CNPUE" edc:nzwidth="0x20" edc:por="----------------0000--00------00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860450">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUE0" edc:desc="" edc:mask="0x1" edc:name="CNPUE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE1" edc:desc="" edc:mask="0x1" edc:name="CNPUE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUE8" edc:desc="" edc:mask="0x1" edc:name="CNPUE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE9" edc:desc="" edc:mask="0x1" edc:name="CNPUE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUE12" edc:desc="" edc:mask="0x1" edc:name="CNPUE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE13" edc:desc="" edc:mask="0x1" edc:name="CNPUE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE14" edc:desc="" edc:mask="0x1" edc:name="CNPUE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE15" edc:desc="" edc:mask="0x1" edc:name="CNPUE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnn--nn------nn" edc:cname="CNPDE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--00------00" edc:name="CNPDE" edc:nzwidth="0x20" edc:por="----------------0000--00------00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860460">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDE0" edc:desc="" edc:mask="0x1" edc:name="CNPDE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE1" edc:desc="" edc:mask="0x1" edc:name="CNPDE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDE8" edc:desc="" edc:mask="0x1" edc:name="CNPDE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE9" edc:desc="" edc:mask="0x1" edc:name="CNPDE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDE12" edc:desc="" edc:mask="0x1" edc:name="CNPDE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE13" edc:desc="" edc:mask="0x1" edc:name="CNPDE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE14" edc:desc="" edc:mask="0x1" edc:name="CNPDE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE15" edc:desc="" edc:mask="0x1" edc:name="CNPDE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n---n-----------" edc:cname="CNCONE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONE" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860470">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE E" edc:pos="14"/>
      </edc:SFRDef>
