Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="----------------nnnn--nn------nn" edc:cname="CNENE" edc:desc="" edc:grp="PORTE" edc:impl="0xffc0f303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--00------00" edc:name="CNENE" edc:nzwidth="0x20" edc:por="----------------0000--00------00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860480">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEE0" edc:desc="" edc:mask="0x1" edc:name="CNIEE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE1" edc:desc="" edc:mask="0x1" edc:name="CNIEE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEE8" edc:desc="" edc:mask="0x1" edc:name="CNIEE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE9" edc:desc="" edc:mask="0x1" edc:name="CNIEE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEE12" edc:desc="" edc:mask="0x1" edc:name="CNIEE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE13" edc:desc="" edc:mask="0x1" edc:name="CNIEE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE14" edc:desc="" edc:mask="0x1" edc:name="CNIEE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE15" edc:desc="" edc:mask="0x1" edc:name="CNIEE15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnn--nn------nn" edc:cname="CNSTATE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--00------00" edc:name="CNSTATE" edc:nzwidth="0x20" edc:por="----------------0000--00------00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860490">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATE0" edc:desc="" edc:mask="0x1" edc:name="CNSTATE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE1" edc:desc="" edc:mask="0x1" edc:name="CNSTATE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE8" edc:desc="" edc:mask="0x1" edc:name="CNSTATE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE9" edc:desc="" edc:mask="0x1" edc:name="CNSTATE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE12" edc:desc="" edc:mask="0x1" edc:name="CNSTATE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE13" edc:desc="" edc:mask="0x1" edc:name="CNSTATE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE14" edc:desc="" edc:mask="0x1" edc:name="CNSTATE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE15" edc:desc="" edc:mask="0x1" edc:name="CNSTATE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnn--nn------nn" edc:cname="CNNEE" edc:desc="" edc:impl="0xf303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--00------00" edc:name="CNNEE" edc:nzwidth="32" edc:por="----------------0000--00------00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8604A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEE0" edc:mask="0x1" edc:name="CNNEE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE1" edc:mask="0x1" edc:name="CNNEE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEE8" edc:mask="0x1" edc:name="CNNEE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE9" edc:mask="0x1" edc:name="CNNEE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEE12" edc:mask="0x1" edc:name="CNNEE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE13" edc:mask="0x1" edc:name="CNNEE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE14" edc:mask="0x1" edc:name="CNNEE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE15" edc:mask="0x1" edc:name="CNNEE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
