Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="------------------------------nn" edc:cname="SRCON1F" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="SRCON1F" edc:nzwidth="32" edc:por="------------------------------00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8605D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1F0" edc:mask="0x1" edc:name="SR1F0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1F1" edc:mask="0x1" edc:name="SR1F1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x1F8605E0"/>
      <edc:SFRDef edc:access="----------------n---nnnnnn------" edc:cname="ANSELG" edc:desc="" edc:grp="PORTG" edc:impl="0xffff8fc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---111111------" edc:name="ANSELG" edc:nzwidth="0x20" edc:por="----------------1---111111------" edc:portals="CLR SET INV" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860600">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSG6" edc:desc="" edc:mask="0x1" edc:name="ANSG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG7" edc:desc="" edc:mask="0x1" edc:name="ANSG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG8" edc:desc="" edc:mask="0x1" edc:name="ANSG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG9" edc:desc="" edc:mask="0x1" edc:name="ANSG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG10" edc:desc="" edc:mask="0x1" edc:name="ANSG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG11" edc:desc="" edc:mask="0x1" edc:name="ANSG11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSG15" edc:desc="" edc:mask="0x1" edc:name="ANSG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnn----nn" edc:cname="TRISG" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111111111----11" edc:name="TRISG" edc:nzwidth="0x20" edc:por="----------------1111111111----11" edc:portals="CLR SET INV" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860610">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISG0" edc:desc="" edc:mask="0x1" edc:name="TRISG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG1" edc:desc="" edc:mask="0x1" edc:name="TRISG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISG6" edc:desc="" edc:mask="0x1" edc:name="TRISG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG7" edc:desc="" edc:mask="0x1" edc:name="TRISG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG8" edc:desc="" edc:mask="0x1" edc:name="TRISG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISG9" edc:desc="" edc:mask="0x1" edc:name="TRISG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG10" edc:desc="" edc:mask="0x1" edc:name="TRISG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG11" edc:desc="" edc:mask="0x1" edc:name="TRISG11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISG12" edc:desc="" edc:mask="0x1" edc:name="TRISG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISG13" edc:desc="" edc:mask="0x1" edc:name="TRISG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISG14" edc:desc="" edc:mask="0x1" edc:name="TRISG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG15" edc:desc="" edc:mask="0x1" edc:name="TRISG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnn----nn" edc:cname="PORTG" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxx----xx" edc:name="PORTG" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxx----xx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTG" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860620">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RG0" edc:desc="" edc:mask="0x1" edc:name="RG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RG1" edc:desc="" edc:mask="0x1" edc:name="RG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RG6" edc:desc="" edc:mask="0x1" edc:name="RG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RG7" edc:desc="" edc:mask="0x1" edc:name="RG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RG8" edc:desc="" edc:mask="0x1" edc:name="RG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RG9" edc:desc="" edc:mask="0x1" edc:name="RG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RG10" edc:desc="" edc:mask="0x1" edc:name="RG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RG11" edc:desc="" edc:mask="0x1" edc:name="RG11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RG12" edc:desc="" edc:mask="0x1" edc:name="RG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RG13" edc:desc="" edc:mask="0x1" edc:name="RG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RG14" edc:desc="" edc:mask="0x1" edc:name="RG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RG15" edc:desc="" edc:mask="0x1" edc:name="RG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnn----nn" edc:cname="LATG" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxx----xx" edc:name="LATG" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxx----xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860630">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATG0" edc:desc="" edc:mask="0x1" edc:name="LATG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG1" edc:desc="" edc:mask="0x1" edc:name="LATG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATG6" edc:desc="" edc:mask="0x1" edc:name="LATG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG7" edc:desc="" edc:mask="0x1" edc:name="LATG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG8" edc:desc="" edc:mask="0x1" edc:name="LATG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATG9" edc:desc="" edc:mask="0x1" edc:name="LATG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG10" edc:desc="" edc:mask="0x1" edc:name="LATG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG11" edc:desc="" edc:mask="0x1" edc:name="LATG11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATG12" edc:desc="" edc:mask="0x1" edc:name="LATG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATG13" edc:desc="" edc:mask="0x1" edc:name="LATG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATG14" edc:desc="" edc:mask="0x1" edc:name="LATG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG15" edc:desc="" edc:mask="0x1" edc:name="LATG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnn----nn" edc:cname="ODCG" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="ODCG" edc:nzwidth="0x20" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860640">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCG0" edc:desc="" edc:mask="0x1" edc:name="ODCG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG1" edc:desc="" edc:mask="0x1" edc:name="ODCG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCG6" edc:desc="" edc:mask="0x1" edc:name="ODCG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG7" edc:desc="" edc:mask="0x1" edc:name="ODCG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG8" edc:desc="" edc:mask="0x1" edc:name="ODCG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG9" edc:desc="" edc:mask="0x1" edc:name="ODCG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG10" edc:desc="" edc:mask="0x1" edc:name="ODCG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG11" edc:desc="" edc:mask="0x1" edc:name="ODCG11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG12" edc:desc="" edc:mask="0x1" edc:name="ODCG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG13" edc:desc="" edc:mask="0x1" edc:name="ODCG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG14" edc:desc="" edc:mask="0x1" edc:name="ODCG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG15" edc:desc="" edc:mask="0x1" edc:name="ODCG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnn----nn" edc:cname="CNPUG" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="CNPUG" edc:nzwidth="0x20" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860650">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUG0" edc:desc="" edc:mask="0x1" edc:name="CNPUG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG1" edc:desc="" edc:mask="0x1" edc:name="CNPUG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUG6" edc:desc="" edc:mask="0x1" edc:name="CNPUG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG7" edc:desc="" edc:mask="0x1" edc:name="CNPUG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG8" edc:desc="" edc:mask="0x1" edc:name="CNPUG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG9" edc:desc="" edc:mask="0x1" edc:name="CNPUG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG10" edc:desc="" edc:mask="0x1" edc:name="CNPUG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG11" edc:desc="" edc:mask="0x1" edc:name="CNPUG11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG12" edc:desc="" edc:mask="0x1" edc:name="CNPUG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG13" edc:desc="" edc:mask="0x1" edc:name="CNPUG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG14" edc:desc="" edc:mask="0x1" edc:name="CNPUG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG15" edc:desc="" edc:mask="0x1" edc:name="CNPUG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnn----nn" edc:cname="CNPDG" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="CNPDG" edc:nzwidth="0x20" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860660">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDG0" edc:desc="" edc:mask="0x1" edc:name="CNPDG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG1" edc:desc="" edc:mask="0x1" edc:name="CNPDG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDG6" edc:desc="" edc:mask="0x1" edc:name="CNPDG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG7" edc:desc="" edc:mask="0x1" edc:name="CNPDG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG8" edc:desc="" edc:mask="0x1" edc:name="CNPDG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG9" edc:desc="" edc:mask="0x1" edc:name="CNPDG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG10" edc:desc="" edc:mask="0x1" edc:name="CNPDG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG11" edc:desc="" edc:mask="0x1" edc:name="CNPDG11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG12" edc:desc="" edc:mask="0x1" edc:name="CNPDG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG13" edc:desc="" edc:mask="0x1" edc:name="CNPDG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG14" edc:desc="" edc:mask="0x1" edc:name="CNPDG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG15" edc:desc="" edc:mask="0x1" edc:name="CNPDG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n---n-----------" edc:cname="CNCONG" edc:desc="" edc:grp="PORTG" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONG" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860670">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE G" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnn----nn" edc:cname="CNENG" edc:desc="" edc:grp="PORTG" edc:impl="0xffc0ffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="CNENG" edc:nzwidth="0x20" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860680">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEG0" edc:desc="" edc:mask="0x1" edc:name="CNIEG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG1" edc:desc="" edc:mask="0x1" edc:name="CNIEG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEG6" edc:desc="" edc:mask="0x1" edc:name="CNIEG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG7" edc:desc="" edc:mask="0x1" edc:name="CNIEG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG8" edc:desc="" edc:mask="0x1" edc:name="CNIEG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG9" edc:desc="" edc:mask="0x1" edc:name="CNIEG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG10" edc:desc="" edc:mask="0x1" edc:name="CNIEG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG11" edc:desc="" edc:mask="0x1" edc:name="CNIEG11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG12" edc:desc="" edc:mask="0x1" edc:name="CNIEG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG13" edc:desc="" edc:mask="0x1" edc:name="CNIEG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG14" edc:desc="" edc:mask="0x1" edc:name="CNIEG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG15" edc:desc="" edc:mask="0x1" edc:name="CNIEG15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnn----nn" edc:cname="CNSTATG" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="CNSTATG" edc:nzwidth="0x20" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860690">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATG0" edc:desc="" edc:mask="0x1" edc:name="CNSTATG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG1" edc:desc="" edc:mask="0x1" edc:name="CNSTATG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG6" edc:desc="" edc:mask="0x1" edc:name="CNSTATG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG7" edc:desc="" edc:mask="0x1" edc:name="CNSTATG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG8" edc:desc="" edc:mask="0x1" edc:name="CNSTATG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG9" edc:desc="" edc:mask="0x1" edc:name="CNSTATG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG10" edc:desc="" edc:mask="0x1" edc:name="CNSTATG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG11" edc:desc="" edc:mask="0x1" edc:name="CNSTATG11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG12" edc:desc="" edc:mask="0x1" edc:name="CNSTATG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG13" edc:desc="" edc:mask="0x1" edc:name="CNSTATG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG14" edc:desc="" edc:mask="0x1" edc:name="CNSTATG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG15" edc:desc="" edc:mask="0x1" edc:name="CNSTATG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
