Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0256MCJ064.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR24" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR24" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="27" edc:_begin="0x24" edc:_end="0x28" edc:_addr="0x1F8C026C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR25" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR25" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="28" edc:_begin="0x24" edc:_end="0x28" edc:_addr="0x1F8C0270">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR26" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR26" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="29" edc:_begin="0x24" edc:_end="0x28" edc:_addr="0x1F8C0274">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR27" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR27" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="30" edc:_begin="0x24" edc:_end="0x28" edc:_addr="0x1F8C0278">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR28" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR28" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="31" edc:_begin="0x24" edc:_end="0x28" edc:_addr="0x1F8C027C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR29" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR29" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="32" edc:_begin="0x24" edc:_end="0x28" edc:_addr="0x1F8C0280">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR30" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR30" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="33" edc:_begin="0x24" edc:_end="0x28" edc:_addr="0x1F8C0284">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR31" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR31" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="34" edc:_begin="0x24" edc:_end="0x28" edc:_addr="0x1F8C0288">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR32" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR32" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="35" edc:_begin="0x24" edc:_end="0x28" edc:_addr="0x1F8C028C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f8f0000" edc:endaddr="0x1f900000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_ssx">
      <edc:AdjustPoint edc:offset="1296" edc:_addr="0x1F8F0000"/>
      <edc:SFRDef edc:access="----------------------------rrrr" edc:cname="SBFLAG" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SBFLAG" edc:nzwidth="32" edc:por="----------------------------0000" ltx:baseofperipheral="SB" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8F0510">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T0PGV" edc:desc="" edc:mask="0x1" edc:name="T0PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1PGV" edc:desc="" edc:mask="0x1" edc:name="T1PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2PGV" edc:desc="" edc:mask="0x1" edc:name="T2PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3PGV" edc:desc="" edc:mask="0x1" edc:name="T3PGV" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="31500" edc:_addr="0x1F8F0514"/>
      <edc:SFRDef edc:access="C---CCCC--------rrrrrrrrrrrr-rrr" edc:cname="SBT0ELOG1" edc:desc="" edc:impl="0x8f00fff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---0000--------000000000000-000" edc:name="SBT0ELOG1" edc:nzwidth="32" edc:por="0---0000--------000000000000-000" ltx:memberofperipheral="" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="2" edc:_begin="0x4" edc:_end="0x10" edc:_addr="0x1F8F8020">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="" edc:mask="0x7" edc:name="CMD" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="" edc:mask="0xf" edc:name="REGION" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="INITID" edc:desc="" edc:mask="0xff" edc:name="INITID" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CODE" edc:desc="" edc:mask="0xf" edc:name="CODE" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="MULTI" edc:desc="" edc:mask="0x1" edc:name="MULTI" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------------rr" edc:cname="SBT0ELOG2" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="SBT0ELOG2" edc:nzwidth="32" edc:por="------------------------------00" ltx:memberofperipheral="" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="2" edc:_begin="0x4" edc:_end="0x10" edc:_addr="0x1F8F8024">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP" edc:desc="" edc:mask="0x3" edc:name="GROUP" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
